ansarirahim/esp32s3-dualusb-fw-clean/esp32s3-dualusb-fw/test/sdkconfig.defaults
# Default SDK Configuration for Unit Tests
# This configuration is optimized for running unit tests on ESP32-S3

# Target Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Memory Configuration
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=16384

# Heap Configuration
CONFIG_HEAP_TRACING=y
CONFIG_HEAP_TRACING_STACK_DEPTH=4

# Logging Configuration
CONFIG_LOG_DEFAULT_LEVEL=4
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS Configuration
CONFIG_FREERTOS_ENABLE_STATIC_TASK_CLEAN_UP=y
CONFIG_FREERTOS_ENABLE_TASK_SNAPSHOT=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FATFS Configuration
CONFIG_FATFS_CODEPAGE_DYNAMIC=y
CONFIG_FATFS_CODEPAGE_437=y
CONFIG_FATFS_LFN_UNICODE=y
CONFIG_FATFS_API_ENCODING_UTF_8=y

# Wear Levelling Configuration
CONFIG_WL_SECTOR_SIZE=4096

# USB Configuration
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_PORT_FULL_SPEED_0=y
CONFIG_TINYUSB_DEVICE_ENABLED=y
CONFIG_TINYUSB_DEVICE_MSC_ENABLED=y

# Unity Testing Framework
CONFIG_UNITY_ENABLE_FIXTURE=y
CONFIG_UNITY_ENABLE_DOUBLE=y

# Performance Monitoring
CONFIG_PERF_MONITOR_ENABLED=y

# Debug Configuration
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
CONFIG_ESP_SYSTEM_CHECK_FREQ_HZ=1000

# Optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y

# Security
CONFIG_SECURE_BOOT_ENABLED=n
CONFIG_SECURE_FLASH_ENC_ENABLED=n

